// const numbers = [5, 8, -1, "-6", 11, "ololo", "-2"];
// let sum = 0;
// for (let i = 0; i < numbers.length; i++) {
//     sum += numbers[i];
// }

// alert("Sum is " + sum);
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// 1. **Оголошення масиву та змінної:**
//    - Створення масиву `numbers`: `[5, 8, -1, '-6', 11, 'ololo', '-2']`.
//    - Ініціалізація змінної `sum` на початку значенням 0.

// 2. **Цикл `for`:**
//    - Ітерація 1:
//      - `i = 0`. Перевірка умови: `0 < 7` - умова виконується.
//      - `sum = sum + numbers[0]`. Після цього `sum = 5`.
//    - Ітерація 2:
//      - `i = 1`. Перевірка умови: `1 < 7` - умова виконується.
//      - `sum = sum + numbers[1]`. Після цього `sum = 13`.
//    - Ітерація 3:
//      - `i = 2`. Перевірка умови: `2 < 7` - умова виконується.
//      - `sum = sum + numbers[2]`. Після цього `sum = 12`.
//    - Ітерація 4:
//      - `i = 3`. Перевірка умови: `3 < 7` - умова виконується.
//      - `sum = sum + numbers[3]`. Тут відбувається конкатенація рядка `-6` до `sum`, отримуємо `'12' + '-6' = '12-6'`.
//    - Ітерація 5:
//      - `i = 4`. Перевірка умови: `4 < 7` - умова виконується.
//      - `sum = sum + numbers[4]`. Це призводить до конкатенації числа `11` до рядка `'12-6'`, тому `sum = '12-611'`.
//    - Ітерація 6:
//      - `i = 5`. Перевірка умови: `5 < 7` - умова виконується.
//      - `sum = sum + numbers[5]`. Цей рядок `'ololo'` конкатенується до `'12-611'`, тому `sum = '12-611ololo'`.
//    - Ітерація 7:
//      - `i = 6`. Перевірка умови: `6 < 7` - умова виконується.
//      - `sum = sum + numbers[6]`. Цей рядок `'-2'` додається до `'12-611ololo'`, тому `sum = '12-611ololo-2'`.

// 3. **Виведення результату:**
//    - `alert('Sum is ' + sum)`. У вікні браузера виводиться "Sum is 12-611ololo-2".
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

//  НА ітерації 3 сума стала = '12-6' .
//  Тому далі вже пішла конкотенація до рядка

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

// ось як можна виправити баг

const numbers = [5, 8, -1, "-6", 11, "ololo", "-2"];
let sum = 0;

for (let i = 0; i < numbers.length; i++) {
    if (!isNaN(numbers[i])) {
        // якщо елемент число або може до нього перетворитись то
        sum += Number(numbers[i]); // візьми елемент і додай його до сумми попередньо перетворивши на число
    }
}

alert("Sum is " + sum);
